In [16]:
import pandas as pd
import numpy as np
import pydataset

initiated datasets repo at: /home/jailson/.pydataset/

In [4]:
s = pd.Series([1,4,6,5,7,10,6])
s

0     1
1     4
2     6
3     5
4     7
5    10
6     6
dtype: int64

In [9]:
df = pd.DataFrame([['fchollet/keras',11302],['openai/universe',4350],['pandas-dev/pandas',8168]],columns=['repository','stars'])
df

          repository  stars
0     fchollet/keras  11302
1    openai/universe   4350
2  pandas-dev/pandas   8168

In [12]:
#mostrando os elemnetos da coluna Stars
print(df['stars'])
#média da coluna stars
print("A média da coluna stars é: ",df['stars'].mean())

0    11302
1     4350
2     8168
Name: stars, dtype: int64
A média da coluna stars é:  7940.0

In [13]:
#acessando uma linha especifica no dataframe
df.iloc[1]#passa entre cochetes o numero da linha. ele retorna um dicionario

repository    openai/universe
stars                    4350
Name: 1, dtype: object

In [14]:
#substituindo os indices 
df.index = pd.Index([1,2,3])
df

          repository  stars
1     fchollet/keras  11302
2    openai/universe   4350
3  pandas-dev/pandas   8168

In [17]:
#Carregando dados com pyDataset
titanic = pydataset.data('titanic')
titanic.head()#pode adicionar o tanto de itens para visualizar mas por padrão mostra somente 5 itens

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [18]:
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [20]:
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64